---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultusegmentRampRiserError
source: html/84a67eb1-4a03-b19f-50ca-47b3dc48097b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultusegmentRampRiserError Property

Ramp can't have multisegment Riser.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultusegmentRampRiserError { get; }
```